<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<head>
<meta charset="UTF-8">
<title>Dictionary-JackSon</title>
<style type="text/css">

	.subContent{
		    display: block;
		    border-top: 5px solid #7eb98b;
		    background-color: #8a8a8a1f;
		    padding: 10px;
		    font-weight: bold;
		    border-radius: 18px;
		    
	}
</style>

</head>
<body>
<!-- ------------------------- header ---------------------------- -->
	<jsp:include page="/WEB-INF/views/common/header.jsp"/>

  <!-- ------------------------main--------------------------------------- -->
  
  <!-- 
  
  	대표사진
	소개(이름, 본명, 출생, 국적, 신체, 소속사, 포지션)
	개인 소개
	데뷔일화
	성격
	TMI
  
   -->
  
  <div class="DGDIv container">
  
  		<!-- 대표사진 -->
  		<img style="width: 100%; height: 100%;" src="${contextPath}/resources/img/person/d_jackson.jpg">
  	
  		<h4 id="title">JackSon</h4>
  		<hr>
  		<div id="part1">
  		<div id="imgd">
  		
  		<!-- 사진 정사각형으로 자르고 넣기 -->
  		<img id="img2" src="${contextPath}/resources/img/person/jackson.jpg">
  		</div>
  		
  		<!-- 소개(이름, 본명, 출생, 국적, 신체, 학력, 소속사, 포지션) -->
  		<div  style="width: 49%;display: inline-block;margin-bottom: 10px;">
  		<table id="t">
  			<tr>
  				<th>Nick name</th>
  				<th>JackSon</th>
  			</tr>
  			<tr>
  				<th>Real name</th>
  				<th>王嘉爾 | Jackson Wang</th>
  			</tr>
  			<tr>
  				<th rowspan="2">Born</th>
  				<th>1994/03/28</th>
  			</tr>
  			<tr>
  				<th>홍콩</th>
  			</tr>
  			<tr>
  				<th>Nationality</th>
  				<th>Hong Kong</th>
  			</tr>
  			<tr>
  				<th>Body</th>
  				<th>174cm, 63kg, O형</th>
  			</tr>
  			<tr>
  				<th>Agency</th>
  				<th>JYP ENTERTAINMENT</th>
  			</tr>
  			<tr>
  				<th>Position</th>
  				<th>Rap</th>
  			</tr>
  			<tr>
  				<th>SNS</th>
  				<th><a href="https://www.instagram.com/jacksonwang852g7/">instagram</a></th>
  			</tr>
  		</table>
  		</div>
  		</div>
  
  <hr>
  
  <!-- 개인 소개  -->
  		
  
  		<div>
  			<h5 class="center team">Before one's debut</h5>
  			<p style="display: none;" class="mainText">
  			어머니는 전직 체조 선수 출신이며, 아버지는 펜싱 감독이다. 부모님이 모두 국가대표 출신 운동선수로 어릴 때는 어머니의 영향을 받아 체조를 하다 홍콩 대표팀 선발시험에 참가하여 팀에 뽑혔지만, 키가 크지 않는 잭슨이 걱정되어 체조를 그만두고 10살 때부터는 아버지를 따라 펜싱을 했다. 아버지의 지도 아래 펜싱 카데트 급(17세 이하) 대회에서 1등을 할 정도로 월등한 펜싱 실력을 갖추었으며 홍콩 펜싱국가대표로 선발되어 대표팀 막내이기도 했다. JYP의 캐스팅이 아니었다면 런던올림픽에 출전할 계획이었다고 한다. 16년 브라질 올림픽에서는 메달까지도 목표였다고. 여담으로 국제펜싱협회 홈페이지에 잭슨의 이름을 치면 아직 선수로 등록되어 있는 것을 볼 수 있다. 링크 [17]

펜싱을 하던 시절부터 한국과의 인연은 깊었다. 12살에 만난 단짝 친구는 한국계 홍콩인 펜싱선수 니콜라스[18]였고, 국제대회에서 이어진 교류 때문에 한국인 펜싱 선수들과도 굉장히 친하다. 홍콩의 미국 국제학교(American International School of Hong Kong를 다니면서 한국인 친구들과 놀았고 다이나믹 듀오와 도끼의 랩을 즐겨 들었다고 한다..
그리고 2010년 12월 즈음 학교에서 농구를 하다가 JYP엔터테인먼트에 캐스팅되었다. JYP 국제 오디션에서 2000:1의 경쟁률로 1등을 했다. 당시 잭슨의 꿈은 올림픽 금메달을 따는 것이기도 했지만 래퍼 또한 되고 싶어서 선수활동을 하면서도 음악을 계속 하고 있었다. 하지만 런던올림픽을 준비하고 있는 상황에서
당연히 부모님의 반대와 부딪혔다. 그러나 끈질긴 설득 끝에 결국 '아시아의 최고가 되지 못하면 안 보내준다, 이번 시합에서 1등 해야 된다' 라는 조건 아래 허락을 받아냈다.[19] 2010년 유스 올림픽에서 홍콩 대표로 출전해 카데드(17세 이하) 사브르 11위를 기록했다.[20] #2010년 제1회 유스 올림픽(싱가포르) 펜싱 경기 결과
2011년에는 아시아 카데드(17세 이하)&주니어(20세 이하) 펜싱 대회에 나가 17세 이하 사브르 단체전[21], 개인전으로 금메달 2개를 [22]따낸 후 한국에 왔다. [23] 이게 17살 때까지의 얘기.

2016년 MC를 맡고 있는 '중국판 냉장고를 부탁해'에서 한국에 오기 전 홍콩대, 스탠퍼드에서 오퍼를 받았다는 사실을 밝히기도 했다.[
			</p>
  		
  		</div>
  		
  		<hr>
  
  
  
  <!-- 프로듀싱 -->
  	<div>
  		<h5 class="center">Producing</h5>
  		<div style="display: none;" class="mainText">
  			데뷔 초반부터 내세운 마샬아츠트릭킹을 기반으로 한 퍼포먼스를 보여주는 그룹인 갓세븐에서 마샬아츠를 할 줄 아는 멤버이다
  			춤을 출 때 동작이 힘있게 딱딱 떨어진다. 또 리듬을 굉장히 잘타는 듯. 아무래도 운동선수 출신이다보니 몸을 굉장히 잘 컨트롤한다. 춤선에 그루브가 많이 묻어나는 편. 어떤 춤을 춰도 본인 스타일로 바꿔서 춘다는 평이 많다. 주장르는 크럼핑, 얼반.
  			
  			목소리 톤이 좋아서 보컬도 제법 듣기 좋다. 가끔 보컬 파트를 맡을 때도 있는데, 본래의 포지션이 래퍼라는 위화감은 느껴지지 않고 오히려 실력발휘를 한다. 래퍼라인 중 가장 보컬 파트가 많은 편이며 후렴구를 맡거나 서브보컬 수준의 파트분배를 받는 경우도 있다.[26] 특히 팬미팅이나 콘서트 무대에서 보컬을 자주 했으며 미니 10집 Call My Name 부터는 앨범에서 차지하는 보컬과 랩의 비중이 비슷할 정도이다.
			
  		</div>
  		
		
	
  	</div>
  <hr>
  
  
  
  <!-- 예능 -->
  	 <div>
	  		<h5 class="center">entertainment</h5>
	  		<br>
	  			<div style="display: none;" class="mainText">
	  			외국인 멤버임에도 불구하고 특유의 성격과 능숙한 한국어로 예능쪽에서의 활약이 상당했다. 갓세븐은 몰라도 잭슨은 아는 사람들도 많다. 특히 여러 방송에 출연해 나이대가 있는 세대에게 인지도가 꽤나 높은 편.
	  			본격적으로 잭슨의 이름을 알리게 된 예능프로그램은 SBS의 예능프로그램 룸메이트 시즌2. 마샬아츠 담당이라는 점을 어필하기 위해서인지 룸메이트들과 첫 만남부터 인사를 공중회전(...)으로 했다. 나중에 합류한 멤버에게 인사할 때도 마찬가지. 이 프로그램을 촬영하면서 방송에 나온 것만 따져도 거의 20번이 넘는다. [27] 서강준과 한 방을 썼는데, 왕♡서방이라고 벽에 떡하니 쓰여져 있다(...). 친화력이 좋아 이 프로그램의 주요 에이스 중 한명으로 활약 중이다. 크리스마스 특집 때는 부모님와의 감격적인 모자상봉으로 방송 이후 화제가 되기도 했다.# 팬들에게는 눈물지뢰로 불리는 영상.

결국 2014년 SBS 연예대상에서 신인상을 받았다. 2015~2016년을 기준으로 대중들에게는 갓세븐 멤버 중 가장 익숙할 멤버일 것이다.

SBS와의 인연은 계속되어 김유정, 홍종현과 함께 인기가요 3MC체제에 입성했다. 차분한 진행에 충실했던 두 MC가 가지지 못한 뛰어난 예능감과 준비된 오버 액션들을 발산하며 인기가요 진행에 생기를 북돋워주는 역할을 맡았다. 외국인 멤버로서는 참으로 특이한 행보.(...)
150517~160501 약 1년 간 MC로 활약했다.

2016년 4월 4일 KBS '우리말 겨루기' 621회 외국인편에 god의 박준형, 로미나, 아비가일과 함께 나와 그동안 갈고닦은(?) 한국어 실력을 뽐냈다.
이 프로그램의 편집 영상이 온갖 커뮤니티와 페이스북을 떠돌아다니기도 했다.

천진난만한 성격 때문에 독한 예능에서 잘 삐치는데 예능인 잭슨의 모습을 좋아하는 팬들은 그게 더 귀엽다고 오히려 좋아한다.(...)

리얼입대 프로젝트 진짜 사나이에 출연하여 용사의 다짐 가사의 우리의 사명 부분을 "우리의 사망"으로 바꿔서 큰 웃음을 주기도 했다.

2016 설날 아육대 혼성 양궁에 마크, 트와이스 다현, 미나와 함께 출전했으나, 육몽이 보는 앞에서 세트 직격을 하며 갓세븐 - 트와이스 팀이 비투비 - CLC 팀에게 27점 차로 패해 광탈하는 원인을 제공했다.

2017년부터는 한국보다는 중국 예능에 집중하는 모습. 중국에서도 실제로 웨이보 팔로워수가 급증하고, 라이징 스타 상을 받는 등 현지에서도 좋은 반응을 얻고 있다.
			  </div>	
	  	</div>
	  <hr>
  
  
  <!-- 성격 -->
  	 <div>
	  		<h5 class="center">Personality</h5>
	  			<div style="display: none;" class="mainText">
	  			기본적으로 사교성이 굉장히 뛰어난 성격을 가지고 있다. 송해와 김흥국에게도 형이라고 부르고 김수미도 누나라고 부르도록 허락을 받아낼 정도의(...) 만렙 친화력을 겸비하고 있다. '잭슨은 누구랑 친해?', '어떤 성향의 사람을 좋아해?' 라는 질문을 받으면 그냥 사람이면 다 좋아한다(...)는 답변을 남길 정도. 잭슨이 아직 안 친한 사람은 아직까지 만나지 않은 사람이라고 팬들이 농담삼아 말할 정도로 친화력이 좋다. 별명도 그래서 왕퍼피다.왈왈 남자다운 생김새와 근육질인 몸과는 달리 의외로 여린 면이 강해 멤버들 중 눈물도 겁도 가장 많은 편. 특히 방송에서 부모님 얘기 나오면 높은 확률로 눈물 장전 모드가 된다. 엄청난 효자.

또 감정표현이 솔직하고 순수하고 말을 정말 예쁘게 한다. 애정표현도 굉장히 많은데, 그 나이 또래 남자들에게는 흔하지 않게 사랑한다, 감사하다는 말을 입에 달고살며, 뽀뽀도 굉장히 좋아한다. 잭슨의 인스타그램만 봐도 팬들과 가족들, 주변사람들을 향한 애정어린 글들을 읽어볼 수 있다. 잭슨을 팬들이 슨랑둥이(잭슨+사랑둥이)라고 부르는 이유 중 하나. 늘 팬들에 대한 사랑을 아낌없이 표현해준다. 잭슨이 팬들에게 했던 말들

또 멤버들에 대한 사랑도 엄청나 멤버들에게(대표적으로 친구인 진영) 자신감을 불어넣어주는 말을 수시로 하며 유겸의 인스타그램에 막내를 귀여워하는 형의 전형적인 모습을 보여주는 애정어린 댓글을 남기기도 했다. 메인보컬을 맡고 있는 영재가 복면가왕 출연 당시 했던 멘트를 세세히 기억하며 노래실력을 칭찬하거나 너는 바로 췌부심이야~~ 갓투데이에서 밝힌 진영의 말로는 부정적인 자신에게 계속 긍정적인 말을 해주는 등 지녕아 넌 될거야!! 넌 돼!! 멤버들을 아끼는 모습을 자주 보인다

예의바르면서도 싹싹하다. 이는 잭슨이 나왔던 여러 예능프로에서도 엿볼 수 있는 모습이다.(매너 좋은 잭슨). 같은 그룹 멤버인 진영의 말로는 잭슨은 부정적이면서 긍정적이라고. 실제로 자신의 외모를 평가하는 것만 봐도 팬들은 전혀 공감할 수 없는 컴플렉스들을 늘어놓으며 자신없어 하지만 자신의 외모를 어떻게 다 좋아하겠냐며 득도한 모습을 보인다.

운동선수 출신이다보니 지구력과 끈기, 의지가 대단하다. 하루 2-3시간 밖에 수면을 취하지 못하는 상황에도 지금 일할 수 있는게 감사하고 행복하다고. 2016년 4월 출연한 주간아이돌에서는 데프콘이 바쁜 와중에 출연해줘서 감사하다고 하자 전혀(!) 바쁘지 않다며 자신이 더 감사하다고 하기도 했다. 또 승부욕과 목표의식도 강하다. 초심을 잃지 말자, 긴장을 풀지 말자는 식의 말을 자주 한다.
       		  </div>
	  	</div>
	  <hr>
  
  <!-- 여담 -->
   <div>
	  		<h5 class="center">TMI(too much information)</h5>
	  			<div style="display: none;" class="mainText">
	  			<ul>
	  				<li>
	  				선수생활을 오래 한 만큼 펜싱 말고도 여러 운동에 능하다. 방송에 나와 했던 종목만 달리기, 수영, 농구 등등 여러가지. 농구의 경우 학창시절에 스포츠 브랜드인 나이키의 농구 대표팀에도 소속되어 있었다고
	  				과거에 럭비가 취미라고 언급한 적도 있으며 볼링 실력도 좋은 편이다. 제자리멀리뛰기, 윗몸일으키기 등 기초훈련종목은 당연히 월등하다. 방송에서 잰 팔굽혀펴기 기록은 1분간 76개.[43] 진짜사나이에서 체격차(...)에도 불구하고 전 농구선수 우지원과 달리기 기록이 같기도 했다. 런닝맨에서는 번외 식으로 잠깐 진행된 제자리 멀리뛰기에서 3m에 달하는 기록을 세우기도 했다. [44] 다만 활쏘기에는 재능이 없다.
	  				</li>
	  				<li>
힘이 센 편이라 의도치 않게 게임 도중에 남의 청바지를 찢어먹는다든지 기물파손을 한다든지 하는 경우도 종종 있고, 멤버들을 내동댕이치거나 들어올려 초토화시켜놓고 신나게 도망치기도 한다. 가끔 흥분하거나 신날 때 힘 조절이 잘 안 되는데 정작 본인은 해맑다.
	  				</li>
	  				<li>
좋아하는 음식은 보기만 해도 느끼한 치즈와 기름 듬뿍 들어간 요리들.(냉부해 출연분 참고) 싫어하는 음식은 매운 음식인데, 싫어한다기보다 무서워하는 것에 가까운 수준이다. 매운 음식을 보기만 해도 땀을 줄줄 흘린다. 그것 외에는 딱히 가리는 음식은 없다. 시골 음식이든 뭐든 다 잘 먹는 편. 과일도 굉장히 좋아하는데 먹는 방법이 다소 특이하다. 귤의 경우 보통 까서 입에 넣는 것과 달리 반쯤 깐 다음 일단 통째로 입에 집어넣고 껍질을 뜯어내 먹고, 포도도 껍질이고 뭐고 송이째 들고 와구와구 먹는다. 글로만 보는 것보다 영상을 보는 것이 훨씬 이해가 잘 간다.
	  				</li>
	  				<li>
꼬부기를 닮았다고 팬싸인회나 콘서트 등에서 각종 꼬부기 인형들을 받는데, 정작 이름이 꼬부기인지 모른다
	  				</li>
	  				<li>
입술을 뜯는 버릇이 있다. 특이한건 손으로가 아니라 이로 입술 안쪽을 물어뜯는다는 것. 잭슨을 보면 입을 우물우물거리는 걸 자주 볼 수 있는데 이 경우 거의 99% 입술을 뜯고 있는 거다. 무의식적인 습관인 것 같으나 긴장하거나 집중하면 더 심해진다.
	  				</li>
	  				<li>
표준중국어, 한국어, 영어, 상하이어, 광동어를 구사할 수 있다.	  				</li>
	  				<li>
홍콩 마담 투소 박물관에 잭슨의 밀랍인형이 제작되어 2019년 7월에 공개되었다. 기사
	  				</li>
	  			</ul>
	  		</div>
	  	</div>
	  <hr>
  

  </div>
  
  
  
  
  
    <!-- ------------------------- footer ---------------------------- -->
    <jsp:include page="/WEB-INF/views/common/footer.jsp" />
    
    
    
    <script>
  			
  $(function(){
	  
  			$(".center").on("click", function() {
				var one = $(this).parent().children(".mainText").css("display");
				var checkSub = $(this).parent().children(".mainText").children(".subContent").css("display");
				
				//console.log($(this).parent().children("p").css("display"));
				
  				var text = $(this).text();
				var textOpen = text + " ▽";
				var textClose = text + " ▷";
				
				if(one == "block"){
					console.log("블럭");
					$(this).parent().children(".mainText").css("display", "none");
					$(this).css("background-color", "#000000de");
					$(this).css("color", "whitesmoke");
					
					if(checkSub == "block"){
						$(this).parent().children(".mainText").children(".subContent").css("display", "block");
					}
					
				}else if(one == "none"){
					
					console.log("논");
					$(this).parent().children(".mainText").css("display", "block");
					$(this).css("background-color", "#f3f3f387");
					$(this).css("color", "#383838");
					
					
					
					if(checkSub == "none"){
						$(this).parent().children(".mainText").children(".subContent").css("display", "block");
					}
				//	console.log($(this).parent().children(".mainText").children(".subContent").css("display"));
					
				}
				
			});
  });
  		
  		</script>
</body>
